espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_gpio_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_GPIO_CLK_EN_REG register
 *  Reserved
 */
#define LP_GPIO_CLK_EN_REG (DR_REG_LP_GPIO_BASE + 0x0)
/** LP_GPIO_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Reserved
 */
#define LP_GPIO_REG_CLK_EN    (BIT(0))
#define LP_GPIO_REG_CLK_EN_M  (LP_GPIO_REG_CLK_EN_V << LP_GPIO_REG_CLK_EN_S)
#define LP_GPIO_REG_CLK_EN_V  0x00000001U
#define LP_GPIO_REG_CLK_EN_S  0

/** LP_GPIO_VER_DATE_REG register
 *  Reserved
 */
#define LP_GPIO_VER_DATE_REG (DR_REG_LP_GPIO_BASE + 0x4)
/** LP_GPIO_REG_VER_DATE : R/W; bitpos: [27:0]; default: 2294563;
 *  Reserved
 */
#define LP_GPIO_REG_VER_DATE    0x0FFFFFFFU
#define LP_GPIO_REG_VER_DATE_M  (LP_GPIO_REG_VER_DATE_V << LP_GPIO_REG_VER_DATE_S)
#define LP_GPIO_REG_VER_DATE_V  0x0FFFFFFFU
#define LP_GPIO_REG_VER_DATE_S  0

/** LP_GPIO_OUT_REG register
 *  Reserved
 */
#define LP_GPIO_OUT_REG (DR_REG_LP_GPIO_BASE + 0x8)
/** LP_GPIO_REG_GPIO_OUT_DATA : R/W/WTC; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_OUT_DATA    0x0000FFFFU
#define LP_GPIO_REG_GPIO_OUT_DATA_M  (LP_GPIO_REG_GPIO_OUT_DATA_V << LP_GPIO_REG_GPIO_OUT_DATA_S)
#define LP_GPIO_REG_GPIO_OUT_DATA_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_OUT_DATA_S  0

/** LP_GPIO_OUT_W1TS_REG register
 *  Reserved
 */
#define LP_GPIO_OUT_W1TS_REG (DR_REG_LP_GPIO_BASE + 0xc)
/** LP_GPIO_REG_GPIO_OUT_DATA_W1TS : WT; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TS    0x0000FFFFU
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TS_M  (LP_GPIO_REG_GPIO_OUT_DATA_W1TS_V << LP_GPIO_REG_GPIO_OUT_DATA_W1TS_S)
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TS_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TS_S  0

/** LP_GPIO_OUT_W1TC_REG register
 *  Reserved
 */
#define LP_GPIO_OUT_W1TC_REG (DR_REG_LP_GPIO_BASE + 0x10)
/** LP_GPIO_REG_GPIO_OUT_DATA_W1TC : WT; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TC    0x0000FFFFU
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TC_M  (LP_GPIO_REG_GPIO_OUT_DATA_W1TC_V << LP_GPIO_REG_GPIO_OUT_DATA_W1TC_S)
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TC_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_OUT_DATA_W1TC_S  0

/** LP_GPIO_ENABLE_REG register
 *  Reserved
 */
#define LP_GPIO_ENABLE_REG (DR_REG_LP_GPIO_BASE + 0x14)
/** LP_GPIO_REG_GPIO_ENABLE_DATA : R/W/WTC; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_ENABLE_DATA    0x0000FFFFU
#define LP_GPIO_REG_GPIO_ENABLE_DATA_M  (LP_GPIO_REG_GPIO_ENABLE_DATA_V << LP_GPIO_REG_GPIO_ENABLE_DATA_S)
#define LP_GPIO_REG_GPIO_ENABLE_DATA_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_ENABLE_DATA_S  0

/** LP_GPIO_ENABLE_W1TS_REG register
 *  Reserved
 */
#define LP_GPIO_ENABLE_W1TS_REG (DR_REG_LP_GPIO_BASE + 0x18)
/** LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS : WT; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS    0x0000FFFFU
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS_M  (LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS_V << LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS_S)
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TS_S  0

/** LP_GPIO_ENABLE_W1TC_REG register
 *  Reserved
 */
#define LP_GPIO_ENABLE_W1TC_REG (DR_REG_LP_GPIO_BASE + 0x1c)
/** LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC : WT; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC    0x0000FFFFU
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC_M  (LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC_V << LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC_S)
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_ENABLE_DATA_W1TC_S  0

/** LP_GPIO_STATUS_REG register
 *  Reserved
 */
#define LP_GPIO_STATUS_REG (DR_REG_LP_GPIO_BASE + 0x20)
/** LP_GPIO_REG_GPIO_STATUS_DATA : R/W/WTC; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_STATUS_DATA    0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_DATA_M  (LP_GPIO_REG_GPIO_STATUS_DATA_V << LP_GPIO_REG_GPIO_STATUS_DATA_S)
#define LP_GPIO_REG_GPIO_STATUS_DATA_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_DATA_S  0

/** LP_GPIO_STATUS_W1TS_REG register
 *  Reserved
 */
#define LP_GPIO_STATUS_W1TS_REG (DR_REG_LP_GPIO_BASE + 0x24)
/** LP_GPIO_REG_GPIO_STATUS_DATA_W1TS : WT; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TS    0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TS_M  (LP_GPIO_REG_GPIO_STATUS_DATA_W1TS_V << LP_GPIO_REG_GPIO_STATUS_DATA_W1TS_S)
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TS_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TS_S  0

/** LP_GPIO_STATUS_W1TC_REG register
 *  Reserved
 */
#define LP_GPIO_STATUS_W1TC_REG (DR_REG_LP_GPIO_BASE + 0x28)
/** LP_GPIO_REG_GPIO_STATUS_DATA_W1TC : WT; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TC    0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TC_M  (LP_GPIO_REG_GPIO_STATUS_DATA_W1TC_V << LP_GPIO_REG_GPIO_STATUS_DATA_W1TC_S)
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TC_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_DATA_W1TC_S  0

/** LP_GPIO_STATUS_NEXT_REG register
 *  Reserved
 */
#define LP_GPIO_STATUS_NEXT_REG (DR_REG_LP_GPIO_BASE + 0x2c)
/** LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT : RO; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT    0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT_M  (LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT_V << LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT_S)
#define LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_STATUS_INTERRUPT_NEXT_S  0

/** LP_GPIO_IN_REG register
 *  Reserved
 */
#define LP_GPIO_IN_REG (DR_REG_LP_GPIO_BASE + 0x30)
/** LP_GPIO_REG_GPIO_IN_DATA_NEXT : RO; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_IN_DATA_NEXT    0x0000FFFFU
#define LP_GPIO_REG_GPIO_IN_DATA_NEXT_M  (LP_GPIO_REG_GPIO_IN_DATA_NEXT_V << LP_GPIO_REG_GPIO_IN_DATA_NEXT_S)
#define LP_GPIO_REG_GPIO_IN_DATA_NEXT_V  0x0000FFFFU
#define LP_GPIO_REG_GPIO_IN_DATA_NEXT_S  0

