espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_gpio_reg.h
/** LP_GPIO_PIN0_REG register
 *  Reserved
 */
#define LP_GPIO_PIN0_REG (DR_REG_LP_GPIO_BASE + 0x34)
/** LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN0_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN0_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN0_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN0_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN0_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN0_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN0_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN0_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN0_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN1_REG register
 *  Reserved
 */
#define LP_GPIO_PIN1_REG (DR_REG_LP_GPIO_BASE + 0x38)
/** LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN1_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN1_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN1_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN1_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN1_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN1_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN1_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN1_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN1_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI1_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN2_REG register
 *  Reserved
 */
#define LP_GPIO_PIN2_REG (DR_REG_LP_GPIO_BASE + 0x3c)
/** LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN2_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN2_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN2_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN2_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN2_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN2_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN2_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN2_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN2_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI2_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN3_REG register
 *  Reserved
 */
#define LP_GPIO_PIN3_REG (DR_REG_LP_GPIO_BASE + 0x40)
/** LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN3_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN3_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN3_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN3_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN3_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN3_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN3_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN3_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN3_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI3_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN4_REG register
 *  Reserved
 */
#define LP_GPIO_PIN4_REG (DR_REG_LP_GPIO_BASE + 0x44)
/** LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN4_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN4_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN4_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN4_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN4_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN4_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN4_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN4_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN4_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI4_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN5_REG register
 *  Reserved
 */
#define LP_GPIO_PIN5_REG (DR_REG_LP_GPIO_BASE + 0x48)
/** LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN5_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN5_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN5_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN5_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN5_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN5_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN5_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN5_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN5_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI5_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN6_REG register
 *  Reserved
 */
#define LP_GPIO_PIN6_REG (DR_REG_LP_GPIO_BASE + 0x4c)
/** LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN6_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN6_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN6_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN6_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN6_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN6_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN6_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN6_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN6_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI6_PIN0_EDGE_WAKEUP_CLR_S  5

