espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_gpio_reg.h
/** LP_GPIO_PIN7_REG register
 *  Reserved
 */
#define LP_GPIO_PIN7_REG (DR_REG_LP_GPIO_BASE + 0x50)
/** LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN7_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN7_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN7_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN7_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN7_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN7_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN7_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN7_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN7_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI7_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN8_REG register
 *  Reserved
 */
#define LP_GPIO_PIN8_REG (DR_REG_LP_GPIO_BASE + 0x54)
/** LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN8_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN8_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN8_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN8_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN8_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN8_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN8_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN8_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN8_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI8_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN9_REG register
 *  Reserved
 */
#define LP_GPIO_PIN9_REG (DR_REG_LP_GPIO_BASE + 0x58)
/** LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN9_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN9_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN9_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN9_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN9_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN9_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN9_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN9_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN9_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI9_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN10_REG register
 *  Reserved
 */
#define LP_GPIO_PIN10_REG (DR_REG_LP_GPIO_BASE + 0x5c)
/** LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN10_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN10_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN10_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN10_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN10_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN10_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN10_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN10_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN10_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI10_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN11_REG register
 *  Reserved
 */
#define LP_GPIO_PIN11_REG (DR_REG_LP_GPIO_BASE + 0x60)
/** LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN11_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN11_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN11_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN11_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN11_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN11_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN11_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN11_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN11_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI11_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN12_REG register
 *  Reserved
 */
#define LP_GPIO_PIN12_REG (DR_REG_LP_GPIO_BASE + 0x64)
/** LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN12_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN12_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN12_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN12_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN12_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN12_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN12_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN12_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN12_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI12_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN13_REG register
 *  Reserved
 */
#define LP_GPIO_PIN13_REG (DR_REG_LP_GPIO_BASE + 0x68)
/** LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN13_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN13_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN13_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN13_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN13_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN13_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN13_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN13_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN13_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI13_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN14_REG register
 *  Reserved
 */
#define LP_GPIO_PIN14_REG (DR_REG_LP_GPIO_BASE + 0x6c)
/** LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN14_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN14_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN14_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN14_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN14_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN14_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN14_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN14_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN14_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI14_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_PIN15_REG register
 *  Reserved
 */
#define LP_GPIO_PIN15_REG (DR_REG_LP_GPIO_BASE + 0x70)
/** LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE    (BIT(0))
#define LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE_M  (LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE_V << LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE_S)
#define LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN15_WAKEUP_ENABLE_S  0
/** LP_GPIO_REG_GPIO_PIN15_INT_TYPE : R/W; bitpos: [3:1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN15_INT_TYPE    0x00000007U
#define LP_GPIO_REG_GPIO_PIN15_INT_TYPE_M  (LP_GPIO_REG_GPIO_PIN15_INT_TYPE_V << LP_GPIO_REG_GPIO_PIN15_INT_TYPE_S)
#define LP_GPIO_REG_GPIO_PIN15_INT_TYPE_V  0x00000007U
#define LP_GPIO_REG_GPIO_PIN15_INT_TYPE_S  1
/** LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER : R/W; bitpos: [4]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER    (BIT(4))
#define LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER_M  (LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER_V << LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER_S)
#define LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER_V  0x00000001U
#define LP_GPIO_REG_GPIO_PIN15_PAD_DRIVER_S  4
/** LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR : WT; bitpos: [5]; default: 0;
 *  need des
 */
#define LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR    (BIT(5))
#define LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR_M  (LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR_V << LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR_S)
#define LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_GPIO_REG_GPI15_PIN0_EDGE_WAKEUP_CLR_S  5

/** LP_GPIO_FUNC0_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC0_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x74)
/** LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC0_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG0_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG0_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG0_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG0_IN_SEL_V << LP_GPIO_REG_GPIO_SIG0_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG0_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG0_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC0_IN_SEL : R/W; bitpos: [7:2]; default: 48;
 *  reg_gpio_func0_in_sel[5:4]==2'b11->constant
 *  1,reg_gpio_func0_in_sel[5:4]==2'b10->constant 0
 */
#define LP_GPIO_REG_GPIO_FUNC0_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC0_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC0_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC0_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC0_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC0_IN_SEL_S  2

/** LP_GPIO_FUNC1_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC1_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x78)
/** LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC1_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG1_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG1_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG1_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG1_IN_SEL_V << LP_GPIO_REG_GPIO_SIG1_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG1_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG1_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC1_IN_SEL : R/W; bitpos: [7:2]; default: 48;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC1_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC1_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC1_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC1_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC1_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC1_IN_SEL_S  2

/** LP_GPIO_FUNC2_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC2_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x7c)
/** LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC2_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG2_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG2_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG2_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG2_IN_SEL_V << LP_GPIO_REG_GPIO_SIG2_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG2_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG2_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC2_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC2_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC2_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC2_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC2_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC2_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC2_IN_SEL_S  2

