espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_gpio_reg.h
/** LP_GPIO_FUNC3_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC3_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x80)
/** LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC3_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG3_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG3_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG3_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG3_IN_SEL_V << LP_GPIO_REG_GPIO_SIG3_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG3_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG3_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC3_IN_SEL : R/W; bitpos: [7:2]; default: 48;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC3_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC3_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC3_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC3_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC3_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC3_IN_SEL_S  2

/** LP_GPIO_FUNC4_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC4_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x84)
/** LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC4_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG4_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG4_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG4_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG4_IN_SEL_V << LP_GPIO_REG_GPIO_SIG4_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG4_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG4_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC4_IN_SEL : R/W; bitpos: [7:2]; default: 48;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC4_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC4_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC4_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC4_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC4_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC4_IN_SEL_S  2

/** LP_GPIO_FUNC5_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC5_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x88)
/** LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC5_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG5_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG5_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG5_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG5_IN_SEL_V << LP_GPIO_REG_GPIO_SIG5_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG5_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG5_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC5_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC5_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC5_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC5_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC5_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC5_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC5_IN_SEL_S  2

/** LP_GPIO_FUNC6_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC6_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x8c)
/** LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC6_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG6_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG6_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG6_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG6_IN_SEL_V << LP_GPIO_REG_GPIO_SIG6_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG6_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG6_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC6_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC6_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC6_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC6_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC6_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC6_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC6_IN_SEL_S  2

/** LP_GPIO_FUNC7_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC7_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x90)
/** LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC7_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG7_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG7_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG7_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG7_IN_SEL_V << LP_GPIO_REG_GPIO_SIG7_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG7_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG7_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC7_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC7_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC7_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC7_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC7_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC7_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC7_IN_SEL_S  2

/** LP_GPIO_FUNC8_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC8_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x94)
/** LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC8_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG8_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG8_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG8_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG8_IN_SEL_V << LP_GPIO_REG_GPIO_SIG8_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG8_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG8_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC8_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC8_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC8_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC8_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC8_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC8_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC8_IN_SEL_S  2

/** LP_GPIO_FUNC9_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC9_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x98)
/** LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC9_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG9_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG9_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG9_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG9_IN_SEL_V << LP_GPIO_REG_GPIO_SIG9_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG9_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG9_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC9_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC9_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC9_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC9_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC9_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC9_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC9_IN_SEL_S  2

/** LP_GPIO_FUNC10_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC10_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x9c)
/** LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC10_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG10_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG10_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG10_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG10_IN_SEL_V << LP_GPIO_REG_GPIO_SIG10_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG10_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG10_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC10_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC10_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC10_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC10_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC10_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC10_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC10_IN_SEL_S  2

/** LP_GPIO_FUNC11_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC11_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xa0)
/** LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC11_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG11_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG11_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG11_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG11_IN_SEL_V << LP_GPIO_REG_GPIO_SIG11_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG11_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG11_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC11_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC11_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC11_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC11_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC11_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC11_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC11_IN_SEL_S  2

/** LP_GPIO_FUNC12_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC12_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xa4)
/** LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC12_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG12_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG12_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG12_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG12_IN_SEL_V << LP_GPIO_REG_GPIO_SIG12_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG12_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG12_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC12_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC12_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC12_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC12_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC12_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC12_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC12_IN_SEL_S  2

