espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_gpio_reg.h
/** LP_GPIO_FUNC13_IN_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC13_IN_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xa8)
/** LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC13_IN_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_SIG13_IN_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_SIG13_IN_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_SIG13_IN_SEL_M  (LP_GPIO_REG_GPIO_SIG13_IN_SEL_V << LP_GPIO_REG_GPIO_SIG13_IN_SEL_S)
#define LP_GPIO_REG_GPIO_SIG13_IN_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_SIG13_IN_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC13_IN_SEL : R/W; bitpos: [7:2]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC13_IN_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC13_IN_SEL_M  (LP_GPIO_REG_GPIO_FUNC13_IN_SEL_V << LP_GPIO_REG_GPIO_FUNC13_IN_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC13_IN_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC13_IN_SEL_S  2

/** LP_GPIO_FUNC0_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC0_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xf4)
/** LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC0_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC0_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC0_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC0_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC0_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC0_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC0_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC0_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC0_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC0_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  reg_gpio_func0_out_sel[5:1]==16 -> output gpio register value to pad
 */
#define LP_GPIO_REG_GPIO_FUNC0_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC0_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC0_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC0_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC0_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC0_OUT_SEL_S  3

/** LP_GPIO_FUNC1_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC1_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xf8)
/** LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC1_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC1_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC1_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC1_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC1_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC1_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC1_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC1_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC1_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC1_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC1_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC1_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC1_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC1_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC1_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC1_OUT_SEL_S  3

/** LP_GPIO_FUNC2_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC2_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0xfc)
/** LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC2_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC2_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC2_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC2_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC2_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC2_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC2_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC2_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC2_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC2_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC2_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC2_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC2_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC2_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC2_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC2_OUT_SEL_S  3

/** LP_GPIO_FUNC3_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC3_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x100)
/** LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC3_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC3_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC3_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC3_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC3_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC3_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC3_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC3_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC3_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC3_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC3_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC3_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC3_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC3_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC3_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC3_OUT_SEL_S  3

/** LP_GPIO_FUNC4_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC4_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x104)
/** LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC4_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC4_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC4_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC4_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC4_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC4_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC4_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC4_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC4_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC4_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC4_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC4_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC4_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC4_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC4_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC4_OUT_SEL_S  3

/** LP_GPIO_FUNC5_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC5_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x108)
/** LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC5_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC5_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC5_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC5_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC5_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC5_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC5_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC5_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC5_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC5_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC5_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC5_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC5_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC5_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC5_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC5_OUT_SEL_S  3

/** LP_GPIO_FUNC6_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC6_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x10c)
/** LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC6_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC6_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC6_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC6_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC6_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC6_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC6_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC6_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC6_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC6_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC6_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC6_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC6_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC6_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC6_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC6_OUT_SEL_S  3

/** LP_GPIO_FUNC7_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC7_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x110)
/** LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC7_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC7_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC7_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC7_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC7_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC7_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC7_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC7_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC7_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC7_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC7_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC7_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC7_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC7_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC7_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC7_OUT_SEL_S  3

/** LP_GPIO_FUNC8_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC8_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x114)
/** LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC8_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC8_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC8_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC8_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC8_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC8_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC8_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC8_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC8_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC8_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC8_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC8_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC8_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC8_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC8_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC8_OUT_SEL_S  3

