espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_gpio_reg.h
/** LP_GPIO_FUNC9_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC9_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x118)
/** LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC9_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC9_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC9_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC9_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC9_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC9_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC9_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC9_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC9_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC9_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC9_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC9_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC9_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC9_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC9_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC9_OUT_SEL_S  3

/** LP_GPIO_FUNC10_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC10_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x11c)
/** LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC10_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC10_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC10_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC10_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC10_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC10_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC10_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC10_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC10_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC10_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC10_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC10_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC10_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC10_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC10_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC10_OUT_SEL_S  3

/** LP_GPIO_FUNC11_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC11_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x120)
/** LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC11_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC11_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC11_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC11_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC11_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC11_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC11_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC11_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC11_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC11_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC11_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC11_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC11_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC11_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC11_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC11_OUT_SEL_S  3

/** LP_GPIO_FUNC12_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC12_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x124)
/** LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC12_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC12_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC12_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC12_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC12_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC12_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC12_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC12_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC12_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC12_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC12_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC12_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC12_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC12_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC12_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC12_OUT_SEL_S  3

/** LP_GPIO_FUNC13_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC13_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x128)
/** LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC13_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC13_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC13_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC13_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC13_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC13_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC13_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC13_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC13_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC13_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC13_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC13_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC13_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC13_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC13_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC13_OUT_SEL_S  3

/** LP_GPIO_FUNC14_OUT_SEL_CFG_REG register
 *  Reserved
 */
#define LP_GPIO_FUNC14_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x12c)
/** LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL    (BIT(0))
#define LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC14_OE_INV_SEL_S  0
/** LP_GPIO_REG_GPIO_FUNC14_OE_SEL : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC14_OE_SEL    (BIT(1))
#define LP_GPIO_REG_GPIO_FUNC14_OE_SEL_M  (LP_GPIO_REG_GPIO_FUNC14_OE_SEL_V << LP_GPIO_REG_GPIO_FUNC14_OE_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC14_OE_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC14_OE_SEL_S  1
/** LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL    (BIT(2))
#define LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL_M  (LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL_V << LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_REG_GPIO_FUNC14_OUT_INV_SEL_S  2
/** LP_GPIO_REG_GPIO_FUNC14_OUT_SEL : R/W; bitpos: [8:3]; default: 32;
 *  Reserved
 */
#define LP_GPIO_REG_GPIO_FUNC14_OUT_SEL    0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC14_OUT_SEL_M  (LP_GPIO_REG_GPIO_FUNC14_OUT_SEL_V << LP_GPIO_REG_GPIO_FUNC14_OUT_SEL_S)
#define LP_GPIO_REG_GPIO_FUNC14_OUT_SEL_V  0x0000003FU
#define LP_GPIO_REG_GPIO_FUNC14_OUT_SEL_S  3

